//Основные методы строк

//Основная функциональность класса String раскрывается через его методы, среди которых можно выделить следующие:

//Compare: сравнивает две строки с учетом текущей культуры (локали) пользователя

//CompareOrdinal: сравнивает две строки без учета локали

//Contains: определяет, содержится ли подстрока в строке

//Concat: соединяет строки

//CopyTo: копирует часть строки, начиная с определенного индекса в массив

//EndsWith: определяет, совпадает ли конец строки с подстрокой

//Format: форматирует строку

//IndexOf: находит индекс первого вхождения символа или подстроки в строке

//Insert: вставляет в строку подстроку

//Join: соединяет элементы массива строк

//LastIndexOf: находит индекс последнего вхождения символа или подстроки в строке

//Replace: замещает в строке символ или подстроку другим символом или подстрокой

//Split: разделяет одну строку на массив строк

//Substring: извлекает из строки подстроку, начиная с указанной позиции

//ToLower: переводит все символы строки в нижний регистр

//ToUpper: переводит все символы строки в верхний регистр

//Trim: удаляет начальные и конечные пробелы из строки